# Pandas

In [ ]:
# Import pandas
import pandas as pd

In [11]:
city=['Delhi','Mumbai','Chennai','Kolkata']
city

['Delhi', 'Mumbai', 'Chennai', 'Kolkata']

In [12]:
df=pd.DataFrame(city)
df

         0
0    Delhi
1   Mumbai
2  Chennai
3  Kolkata

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

In [15]:
row,col=df.shape
row,col

(4, 1)

In [20]:
df1=pd.DataFrame(city,columns=['City in India'], index=['city-1','city-2','city-3','city-4'])
df1

       City in India
city-1         Delhi
city-2        Mumbai
city-3       Chennai
city-4       Kolkata

In [21]:
city2=['New York','Los Angeles','Chicago','Houston']
city2

['New York', 'Los Angeles', 'Chicago', 'Houston']